# 題目 : 溫度轉換程式
# 公式 : F = C*(9/5)+32       攝氏轉成華氏
#        C = (F-32)*(5/9)     華氏轉成攝氏

print('+++++++++++++++++++++++++++++++++++')
print('|       攝氏與華氏溫度轉換器       |')
print('+++++++++++++++++++++++++++++++++++')
print('輸入1將 攝氏溫度°C轉換為華氏溫度°F')
print('輸入2將 華氏溫度°F轉換為攝氏溫度°C\n')

choice = int(input('請選擇要進行的服務(輸入數字1或2): '))
if choice == 1:
    C = float(input('請輸入攝氏溫度: '))
    F = C * 9 / 5 + 32
    print('華氏溫度為: ', F)
elif choice == 2:
    F = float(input('請輸入華氏溫度: '))
    C = (F - 32) * 5 / 9
    print('華氏溫度為: ', C)
else:
    print('請重新選擇要進行的服務(輸入數字1或2): ')